Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K42B.tmx
Source language: en_us
Languages: zh_cn

source: Teacher Fei located the girl's blog without a problem. There were more pictures of her there, some with her mother.
zh_cn: 范老师毫不费力就找到了女孩的博客，博客上的照片更多。

source: Anyone could see the older woman's unease in front of the camera. In her prime she would have been more attractive than her daughter was now, but perhaps it was the diffidence in her face that had softened some of the features that in her daughter's case were accentuated by rage.
zh_cn: 任何人可以看出那位年长妇女在镜头前的不安，她年轻时应该比她的女儿更好看，但也许正是她脸上的不同使得让她女儿义愤填膺的案子显得稍有缓和。

source: Under the heading "Happier Time," Teacher Fei found a black-and-white photo of the family. The girl, aged three or four, sat on a high stool, and her parents stood on either side.
zh_cn: 在“快乐时光”栏目里，范老师看见一张黑白的全家照：女孩才三四岁，坐在一张高登上，父母站在她身边。

source: On the wall behind them was a garden, painted by someone without much artistic taste, Teacher Fei could tell right away.
zh_cn: 他们身后的背景是一个花园，范老师立即可以看出来，画这背景的人没有什么艺术品位。

source: The girl laughed with a mouthful of teeth, and the mother smiled demurely, as a married woman would be expected to in front of a photographer.
zh_cn: 女孩笑着露出嘴里的牙齿，母亲则端庄地微笑着，就像一个已婚妇女被拍照时应该做的那样。

source: The father was handsome, with perfectly shaped cheekbones and deep-set eyes not often found in a Chinese face, but the strain in his smile and the tiredness in those eyes seemed to indicate little of the happiness the daughter believed had existed in her parents' marriage.
zh_cn: 父亲很英俊，颧骨长得完美无缺，眼睛深凹，脸不太像中国人。但是他的笑容僵直，眼神疲惫，看不出他有女儿相信的那种快乐婚姻。

source: Teacher Fei shook his head and scribbled on a scrap of paper the man's name and address and home phone number, as well as the address and number of his work unit, which had all been listed by the girl.
zh_cn: 范老师摇摇头，在一张纸片上记下了男人的姓名，地址和家庭电话，还有他单位的地址和电话，女孩把这些都公布在网上了。

source: A scanned image of his resident's I.D. was displayed, too. Teacher Fei calculated the man's age, forty-six, and noted that on the paper.
zh_cn: 网上还有扫描下来的男人身份证，范老师算了一下，男人的年纪应该是四十六岁，他把年纪也记在纸片上了。

source: When he went to the message board on the girl's Web site, Teacher Fei read a few of the most recent posts, left by sympathetic women claiming to have been similarly hurt by unfaithful husbands or absent fathers.
zh_cn: 范老师看了女孩博客上的留言板，最近的留言是一些女人对女孩表示同情的，她们也受到类似不忠丈夫或失踪父亲的伤害。

source: "Dearest Child," one message started, from a woman calling herself "Another Betrayed Wife," who praised the young girl as an angel of justice and courage.
zh_cn: 一个称自己为“被出卖的妻子”的女人，她的留言用“最亲爱的孩子”开头，把女孩说成是“正义和勇敢的天使”。

source: Teacher Fei imagined these women dialling the father's number at night, or showing up in front of his work unit to brandish cardboard signs covered with words of condemnation.
zh_cn: 范老师想象这些女人会在晚上打女孩父亲的电话，或者在他单位门口挥舞写着谴责他话语的标语牌。

source: "To all who support this young woman's mission," he typed in the box at the bottom of the Web page, "the world will be a better place when one learns to see through to the truth instead of making hasty and unfounded accusations."
zh_cn: 范老师开始在网页下端的方框里打字，“给这位女孩所有的支持者：假如人们能够学会看到真相，而不是急忙无端地指责别人，那么这个世界将会更加美好。”

source: "A Concerned Man," Teacher Fei signed his message.
zh_cn: 范老师给自己留言的签名是“一个关注此事的人”。

source: A different opinion was not what these women would want to hear, but any man with a brain had to accept his responsibility to make the truth known.
zh_cn: 这些女人未必听得进不同意见，但是任何有头脑的男人必须担当起披露真相的责任。

source: A girl among the group of middle schoolers glanced at Teacher Fei and then whispered to a companion, who looked up at him with a snicker before letting herself be absorbed again by the screen.
zh_cn: 那些上网的中学生当中有一个女孩瞥了范老师一眼，然后和同伴小声说了几句，同伴窃笑着看了范老师一眼，然后又被屏幕吸引过去。

source: An old man with wrinkles and without hair. Teacher Fei assessed himself through the girls' eyes: bored and boring, no doubt undesirable in any sense, but who could guarantee the girls that the flirtatious young man online who made their hearts speed was not being impersonated by an equally disgraceful old man?
zh_cn: 范老师想象着女孩眼中的自己：一个满脸皱纹的秃顶老头，无疑不会有任何人要了。但是谁能保证，女孩在网上勾搭的让她们心跳加快的男青年，不是这样一个恬不知耻的老头装扮的呢？

source: Later that evening, when Teacher Fei had wrung a warm towel to the perfect stage of moistness and passed it to his mother, who sat on another towel on her bed, a curtain separating her partly undressed body from him, he thought about the two girls and their youthful indifference.
zh_cn: 后来到了晚上，范老师把热毛巾绞干到正好后递给母亲。她坐在另外一条毛巾上，一条布帘把他与母亲脱了一半衣服的身体隔开。他想到了网吧里的那两个女孩，想到她们那种少不更事。

source: One day, if they were fortunate enough to survive all the disappointments life had in store for them, they would have to settle into their no longer young bodies.
zh_cn: 将来有一天，假如她们足够幸运，能逃过所有人生为她们储存的苦难，她们的身体也将不再年轻。

source: "Do you remember Carpenter Chang?" Teacher Fei's mother asked from the other side of the curtain.
zh_cn: “你还记得张木匠吗？”母亲隔着布帘问。

source: Three times a week, Mrs. Luo bathed Teacher Fei's mother, and on the other evenings Teacher Fei and his mother had to make do with the curtain as he assisted her with her sponge bath and listened to her reminisce about men and women long dead.
zh_cn: 罗太太每周过来为母亲洗三次澡，其它三天晚上范老师只能隔着布帘协助母亲擦澡，同时听她回忆起那些早已逝去的男人和女人。

source: Half an hour, and sometimes an hour, would pass, his mother washing and talking on one side of the curtain, him listening and sometimes pressing for details on the other side.
zh_cn: 母亲在布帘这边擦澡和讲话，范老师在布帘另一边听，有时还会询问一些细节。这样半个小时，有时一个小时很快就过去了，这是一天当中母子两人讲话最多的时候。

source: This was the time of day they talked the most, when Teacher Fei knew that although his mother's body was frail and her mind tangled by memories, she was still the same graceful woman who, with her unhurried storytelling, knew how to take the awkwardness out of a situation in which she had to be cared for by a grown son who had remained a bachelor all his life.
zh_cn: 范老师知道，尽管母亲已经年老体弱，她的记忆有时也会搞混，但她仍然不失为一个优雅的妇人，知道怎样才能不使她那终身未娶的儿子感到尴尬。
